In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [14]:
df = pd.read_csv("login_hours.csv")

In [15]:
df.head()

,active_date,wk,category,service_city,car_number,login_hours,active_hours
0,2018-11-27,48,mini,hyderabad,AP01TV0906,12.007778,7.466667
1,2018-11-21,47,mini,hyderabad,AP02TV2290,0.027500,0.000000
2,2018-11-17,46,mini,hyderabad,AP02TV6490,8.843611,6.700000
3,2018-11-17,46,economy_suv,hyderabad,AP03TB9627,2.074444,0.650000
4,2018-11-27,48,economy_suv,hyderabad,AP03TL3034,18.920556,6.383333

In [16]:
df = df.sort_values(by=['car_number','active_date'],ascending=[True,True])
df = df[df.category != "auto"]

In [17]:
number_of_days = df["car_number"].value_counts()
number_of_days = number_of_days.sort_index()

In [18]:
total_login_hours = df.groupby(["car_number"])["login_hours"].sum()
total_login_hours = total_login_hours.sort_index()

In [19]:
df1 = pd.concat([number_of_days,total_login_hours],axis=1)
df1.columns = ['number_of_days', 'login_hours']
df1.head()

            number_of_days  login_hours
car_number
A29TV6235                8     9.846944
AP01TV0821               7    63.160556
AP01TV0906              28   236.926389
AP02TV1883              44   320.696389
AP02TV2215               8    55.156667

In [21]:
from sklearn.cluster import KMeans

kmeans = KMeans(n_clusters=2)